export type Question = {
    id: string;
    title: string;
    subtitle?: string;
    type: 'single' | 'multiple';
    options: string[];
};

export const testData: Record<string, Question[]> = {
    movie: [
        {
            id: 'genres',
            title: 'Які жанри та теми вам подобаються?',
            subtitle: 'Можна обрати декілька',
            type: 'multiple',
            options: ['Екшн', 'Історія', 'Комедія', 'Біографія', 'Романтика', 'Документалки', 'Хорор', 'Катастрофи', 'Фантастика', 'Виживання', 'Детектив', 'Війна', 'Спорт', 'Вестерн']
        },
        {
            id: 'mood',
            title: 'Який настрій ви хочете отримати від фільму?',
            subtitle: 'Оберіть один варіант',
            type: 'single',
            options: ['Хочу розслабитися та посміятися', 'Хочу поплакати', 'Хочу глибоких емоцій та роздумів', 'Хочу гострих відчуттів та напруги', 'Хочу щось затишне та спокійне']
        },
        {
            id: 'occasion',
            title: 'За яких обставин ви будете дивитися фільм?',
            subtitle: 'Оберіть один варіант',
            type: 'single',
            options: ['Наодинці з собою', 'Романтичне побачення', 'Кіновечір з друзями', 'Перегляд з родиною']
        },
        {
            id: 'age',
            title: 'Якого року випуску має бути фільм?',
            subtitle: 'Оберіть один варіант',
            type: 'single',
            options: ['Не має значення', 'Випущений за останні 5 років', 'Випущений за останні 10 років', 'Випущений за останні 25 років', 'Класика (більше 25 років тому)']
        },
        {
            id: 'duration',
            title: 'Яка бажана тривалість фільму?',
            subtitle: 'Оберіть один варіант',
            type: 'single',
            options: ['Не має значення', 'До 1.5 години', '2 години', 'Більше 2 годин', 'Декілька частин']
        },
        {
            id: 'preferences',
            title: 'Оберіть, що вам ще подобається у кіно:',
            subtitle: 'Можна обрати декілька',
            type: 'multiple',
            options: ['Фільми, засновані на реальних подіях', 'Екранізації книг', 'Щасливий кінець', 'Фільм, що змінить мої погляди на життя', 'Неочікуваний фінал', 'Неймовірна візуальна складова']
        }
    ],
  
    series: [], 
    anime: [],
    book: []
};